{
  "job": {
    "id": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "company": "Full Stack Software Engineer at Clad",
    "role": "Full Stack Software Engineer at Clad",
    "location": "N/A",
    "applicationUrl": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "sourceUrl": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "fullDescription": "Full Stack Software Engineer at Clad | Y Combinator About What Happens at YC? Apply YC Interview Guide FAQ People YC Blog Companies Startup Directory Founder Directory Launch YC Startup Jobs All Jobs ◦ Engineering ◦ Operations ◦ Marketing ◦ Sales Internships Startup Job Guide YC Startup Jobs Blog Find a Co-Founder Library SAFE Resources Startup School Newsletter Requests for Startups For Investors Verify Founders Hacker News Bookface Open main menu Apply for W2026 batch. Apply Clad Project management software for infrastructure. Full Stack Software Engineer $150K - $225K • 0.25% - 0.80% • New York, NY, US Job type Full-time Role Engineering, Full stack Experience 3+ years Visa US citizen/visa only Connect directly with founders of the best YC-funded startups. Apply to role › Jason Rudin Founder Jason Rudin Founder About the role Clad is project management and billing software for infrastructure. What's the role? A product-minded, full stack engineer. You'll be responsible for building out every aspect of Clad's product. You’ll shape not just the code, but also the direction of the business - informing how we work, the products we build, and the team that we'll assemble to achieve our vision. Why are we hiring? We're growing fast, and our growth is constrained on the products we need to build to continue to grow well. We have several strategic Big Bets™️, and need to find someone with the expertise, creativity and passion for solving tough problems to lead some of those initiatives. What are we looking for? Craft: You care about the UX you're building, the code you're writing, the system you're modeling, etc. Ownership: You want to talk to the customer -&gt; define the product -&gt; sketch the UI -&gt; do the modeling -&gt; write the code -&gt; QA the feature -&gt; make sure it works for the customer. We work collaboratively, so you're never on an island, but are looking for ‘full stack’ owners in the truest sense of the word. Business Thinking: You make decisions as if you're an owner of the business, because you are one! Learning &amp; Teaching: You like to figure out better ways to do things and share them with the team. You like to learn from those around you, regardless of job function or experience. About us 3+ years of runway, raised $2.7M from Y Combinator, Better Tomorrow Ventures, and others. Most of it is still in the bank. 6 people - Jason (McKinsey, Instagram), Daniel (Cash App, Pager Duty), Devin (Read AI), Max (Foraged), Stephen (Silo), and Michael (Flexport) In-person team in NYC Our stack - full stack typescript using React/Remix Why Clad The world is rebuilding its internet and power infrastructure. AI is constrained on power and broadband capacity. Renewables demand a new grid. Our hunger for bandwidth is insatiable. The utilities, internet companies, and contractors tasked with this work face immense pressure to deliver. But their tools haven’t caught up. Contractors struggle to grow, constrained by cashflow. Operators fly blind, lacking real time visibility into issues. People type more than they build. Clad unifies project operations and finance to automate project tracking, payments, and permitting. With Clad, contractors grow faster and improve their margins. Operators execute smoothly. And everyone can focus on what’s most important - building. About Clad Clad Founded: 2022 Batch: W23 Team Size: 6 Status: Active Location: New York Founders Jason Rudin Founder Jason Rudin Founder Footer Y Combinator Programs YC Program Startup School Work at a Startup Co-Founder Matching Company YC Blog Contact Press People Careers Privacy Policy Notice at Collection Security Terms of Use Resources Startup Directory Startup Library Investors SAFE Hacker News Launch YC YC Deals Make something people want. Apply Twitter Twitter Facebook Facebook Instagram Instagram LinkedIn LinkedIn Youtube YouTube © 2025 Y Combinator",
    "salary": "",
    "postedDate": "",
    "source": "firecrawl",
    "fetchedAt": "2025-11-25T03:56:16.464Z",
    "status": "not_applied"
  },
  "resumeId": "96298940-768a-4d20-a6cb-33d793c474d4",
  "summary": "Strong technical foundation with full-stack TypeScript/React experience and proven product ownership skills, but lacks domain-specific experience in infrastructure/project management and Remix framework. Geographic availability for NYC in-person role remains unclear, which could impact fit for this early-stage startup.",
  "tailoredBullets": [
    "Built full-stack TypeScript applications with React/Next.js, delivering mission-critical APIs with sub-200ms response times and real-time dashboards that replaced manual processes for 10+ cross-functional team members, demonstrating end-to-end product ownership from customer needs to deployment",
    "Automated business-critical reporting systems for 3,000+ monthly transactions using Python data pipelines, reducing analysis time by 80% and enabling data-driven decision making that directly impacted company growth and operational efficiency",
    "Led performance optimization initiatives across multiple projects, improving load times by 30% and reducing JavaScript payload by 22% through code-splitting and query optimization, showcasing craft-focused approach to UX and system design",
    "Orchestrated scalable infrastructure deployments using modern DevOps practices, supporting 100+ concurrent users with automated CI/CD pipelines and achieving 80-second commit-to-production cycles while maintaining high availability and reliability",
    "Collaborated with cross-functional teams to diagnose and solve complex technical challenges, implementing accessibility improvements and responsive designs that increased user engagement by 18% and demonstrated business-minded problem-solving approach"
  ],
  "coverLetter": "Dear Clad Team, I'm excited to apply for the Full Stack Software Engineer position at Clad, where I can contribute to rebuilding critical infrastructure through innovative project management solutions. Your mission resonates deeply with me as someone who has built mission-critical systems and understands the importance of reliable, scalable software in essential industries. My experience as a Software Engineer at Humanitarians AI has given me hands-on expertise in full-stack TypeScript development, where I've delivered low-latency APIs with sub-200ms response times and built real-time dashboards that transformed manual processes into automated, data-driven workflows. This aligns perfectly with Clad's need for someone who can own products end-to-end, from customer interaction to code deployment. I've demonstrated this ownership mindset by reducing analysis time by 80% through automated reporting systems and improving user experience across multiple projects. What excites me most about Clad is the opportunity to apply my technical skills to solve real business problems in the infrastructure space. My background in performance optimization, scalable system design, and cross-functional collaboration has prepared me to contribute to your Big Bets™️ while learning from your experienced team of engineers from top companies. I'm particularly drawn to your emphasis on craft and business thinking – principles I've applied throughout my career by focusing on UX quality, system reliability, and measurable business impact. I'm eager to bring my passion for building exceptional products and my full-stack expertise to help Clad continue its rapid growth and transform how infrastructure projects are managed and executed.",
  "missingSkills": [
    "Remix framework experience",
    "NYC in-person availability (current location unclear)",
    "Infrastructure/project management domain experience",
    "Billing software experience"
  ],
  "recommendedLearning": [
    "Remix framework (React-based, should be easy transition)",
    "Infrastructure/utilities domain knowledge",
    "Project management software concepts",
    "Billing and financial software systems",
    "Construction/contractor workflow understanding"
  ],
  "fitScores": {
    "fit": 47,
    "skills": 67,
    "experience": 54,
    "overall": 56
  },
  "suitability": "moderate fit",
  "savedTo": "/Users/atharvakamble/Documents/CoreSpeed/backend/data/jobs/analysis_https___www_ycombinator_com_companies_clad_jobs_YHGyRSf-full-stack-software-engineer.json"
}