{
  "job": {
    "id": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "company": "Full Stack Software Engineer at Clad",
    "role": "Full Stack Software Engineer at Clad",
    "location": "N/A",
    "applicationUrl": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "sourceUrl": "https://www.ycombinator.com/companies/clad/jobs/YHGyRSf-full-stack-software-engineer",
    "status": "not_applied",
    "fetchedAt": "2025-11-24T18:26:53.907Z",
    "fullDescription": "Full Stack Software Engineer at Clad | Y Combinator About What Happens at YC? Apply YC Interview Guide FAQ People YC Blog Companies Startup Directory Founder Directory Launch YC Startup Jobs All Jobs ◦ Engineering ◦ Operations ◦ Marketing ◦ Sales Internships Startup Job Guide YC Startup Jobs Blog Find a Co-Founder Library SAFE Resources Startup School Newsletter Requests for Startups For Investors Verify Founders Hacker News Bookface Open main menu Apply for W2026 batch. Apply Clad Project management software for infrastructure. Full Stack Software Engineer $150K - $225K • 0.25% - 0.80% • New York, NY, US Job type Full-time Role Engineering, Full stack Experience 3+ years Visa US citizen/visa only Connect directly with founders of the best YC-funded startups. Apply to role › Jason Rudin Founder Jason Rudin Founder About the role Clad is project management and billing software for infrastructure. What's the role? A product-minded, full stack engineer. You'll be responsible for building out every aspect of Clad's product. You’ll shape not just the code, but also the direction of the business - informing how we work, the products we build, and the team that we'll assemble to achieve our vision. Why are we hiring? We're growing fast, and our growth is constrained on the products we need to build to continue to grow well. We have several strategic Big Bets™️, and need to find someone with the expertise, creativity and passion for solving tough problems to lead some of those initiatives. What are we looking for? Craft: You care about the UX you're building, the code you're writing, the system you're modeling, etc. Ownership: You want to talk to the customer -&gt; define the product -&gt; sketch the UI -&gt; do the modeling -&gt; write the code -&gt; QA the feature -&gt; make sure it works for the customer. We work collaboratively, so you're never on an island, but are looking for ‘full stack’ owners in the truest sense of the word. Business Thinking: You make decisions as if you're an owner of the business, because you are one! Learning &amp; Teaching: You like to figure out better ways to do things and share them with the team. You like to learn from those around you, regardless of job function or experience. About us 3+ years of runway, raised $2.7M from Y Combinator, Better Tomorrow Ventures, and others. Most of it is still in the bank. 6 people - Jason (McKinsey, Instagram), Daniel (Cash App, Pager Duty), Devin (Read AI), Max (Foraged), Stephen (Silo), and Michael (Flexport) In-person team in NYC Our stack - full stack typescript using React/Remix Why Clad The world is rebuilding its internet and power infrastructure. AI is constrained on power and broadband capacity. Renewables demand a new grid. Our hunger for bandwidth is insatiable. The utilities, internet companies, and contractors tasked with this work face immense pressure to deliver. But their tools haven’t caught up. Contractors struggle to grow, constrained by cashflow. Operators fly blind, lacking real time visibility into issues. People type more than they build. Clad unifies project operations and finance to automate project tracking, payments, and permitting. With Clad, contractors grow faster and improve their margins. Operators execute smoothly. And everyone can focus on what’s most important - building. About Clad Clad Founded: 2022 Batch: W23 Team Size: 6 Status: Active Location: New York Founders Jason Rudin Founder Jason Rudin Founder Footer Y Combinator Programs YC Program Startup School Work at a Startup Co-Founder Matching Company YC Blog Contact Press People Careers Privacy Policy Notice at Collection Security Terms of Use Resources Startup Directory Startup Library Investors SAFE Hacker News Launch YC YC Deals Make something people want. Apply Twitter Twitter Facebook Facebook Instagram Instagram LinkedIn LinkedIn Youtube YouTube © 2025 Y Combinator"
  },
  "resumeId": "05fedeee-9ef8-4640-b716-692cb73493b0",
  "summary": "",
  "tailoredBullets": [],
  "coverLetter": "",
  "missingSkills": [],
  "recommendedLearning": [],
  "fitScores": {
    "fit": 0,
    "skills": 0,
    "experience": 0,
    "overall": 0
  },
  "suitability": "",
  "savedTo": "/Users/atharvakamble/Documents/CoreSpeed/backend/data/jobs/analysis_https___www_ycombinator_com_companies_clad_jobs_YHGyRSf-full-stack-software-engineer.json"
}