{
  "job": {
    "id": "https://job-boards.greenhouse.io/pinterest/jobs/6142084",
    "company": "Software Engineer II, Full Stack",
    "role": "Software Engineer II, Full Stack",
    "location": "N/A",
    "applicationUrl": "https://job-boards.greenhouse.io/pinterest/jobs/6142084",
    "sourceUrl": "https://job-boards.greenhouse.io/pinterest/jobs/6142084",
    "fullDescription": "Software Engineer II, Full Stack, Mexico City &#x2B; 1 other locations | Pinterest Careers Skip to main content Careers Jobs Locations Locations Go to Locations North America Europe Latin America Asia Pacific Remote Departments Departments Go to Departments Administration Apprenticeship Corporate Strategy Design Engineering Finance Global Content &amp; Operations Government &amp; Corporate Affairs HR IT Legal &amp; Compliance Marketing &amp; Communications Product Recruiting Sales Trust &amp; Safety University Workplace Early Career Early Career Go to Early Career Apprenticeships University Recruiting Inside Pinterest Inside Pinterest Go to Inside Pinterest Inclusion &amp; Belonging PinFlex Life at Pinterest Blog Events Interviewing Saved Jobs Join Talent Community [Open search bar] Keywords: Location: Locations Amsterdam Atlanta Bay Area Berlin Chicago City Dublin London Los Angeles Mexico City New York New York City Palo Alto Paris Remote Remote - US San Francisco S&#xE3;o Paulo Seattle Singapore Sydney Tokyo Toronto US Zurich Search Save Saved Software Engineer II, Full Stack Mexico City / Remote Engineering Regular Share Apply Now Description About Pinterest: Millions of people around the world come to our platform to find creative ideas, dream about new possibilities and plan for memories that will last a lifetime. At Pinterest, we’re on a mission to bring everyone the inspiration to create a life they love, and that starts with the people behind the product. Discover a career where you ignite innovation for millions, transform passion into growth opportunities, celebrate each other’s unique experiences and embrace the flexibility to do your best work. Creating a career you love? It’s Possible. We are looking for inquisitive, well-rounded Full Stack Software Engineers. Working closely with product managers, designers, and backend engineers, you’ll play an important role in enabling the newest technologies and experiences. You will build robust frameworks &amp; features. You will empower both developers and Pinners alike. You’ll have the opportunity to find creative solutions to thought-provoking problems. Even better, because we covet the kind of courageous thinking that’s required in order for big bets and smart risks to pay off, you’ll be invited to create and drive new initiatives, seeing them from inception through to technical design, implementation, and release. What you’ll do: Support millions of users and enable colleagues by ensuring excellence in core pieces that are shared throughout the application Identify site-wide challenges; propose, test, and ship solutions Drive changes that improve the entire site such as improving accessibility, network frameworks and browser support strategy Enable developers to work more effectively by improving architecture, testing capabilities and release cycles Solve hard-to-see user pain points that often affect every page such as performance, monitoring errors and solving user metric anomalies Grow as a developer by working with world-class peers on varied and high impact projects What we’re looking for: Bachelor’s degree in computer science, a related field or equivalent experience 3+ years of experience building large-scale full-stack products. Deep understanding of web development and best practices in React/Redux Strong experience with programming languages Javascript and Python/Java Strong technical skills, and a willingness to learn new technologies Strong software engineering principles and practices Strong collaboration and communication skills This position is not eligible for relocation assistance. Visit our PinFlex page to learn more about our working model. We let the type of work you do guide the collaboration style. That means we're not always working in an office, but we continue to gather for key moments of collaboration and connection. This role will need to be in the office for in-person collaboration 1-2 times/quarter and therefore can be situated anywhere in the country. #LI-REMOTE #LI-MM Our Commitment to Inclusion: Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you require a medical or religious accommodation during the job application process, please complete this form for support. Latin America Learn more Remote Learn more Engineering Learn more Similar Jobs Here is a selection of our related job opportunities: Sr. Software Engineer, Full Stack Save Saved Mexico City &#x2B; 1 other locations Engineering Sr. Software Engineer, Backend Save Saved Mexico City &#x2B; 1 other locations Engineering Software Engineer, Backend Save Saved Mexico City &#x2B; 1 other locations Engineering See all jobs Play video Life at Pinterest Meet employees from our global offices and find out why they chose to continue their career journeys at Pinterest and be a part of the magic of bringing our platform to life. Back to top Join our talent community Whether you apply to a role today or in the future, stay up-to-date on Pinterest news, events and job openings by signing up for our Talent Community. We&#x2019;ll send you newsletters you won&#x2019;t want to miss. Join About Pinterest Help Center Newsroom Businesses Developers Investors Engineering Blog Pinterest Labs Copyright &amp; Trademark Terms of service Privacy policy Personalized ads Candidate Privacy Notice Protecting our job seekers Sitemap Cookie declaration We’re looking for all kinds of people. Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See the Pinterest EEO Policy Statement for more information regarding U.S. roles. If you require medical or religious accommodation during the job application process, please complete this form for support. &copy; Pinterest 2025, all rights reserved. We care about your privacy Thank you, your preferences have been updated. By clicking \"Accept All\", you agree to the storing of cookies on your device to give you the most optimal experience using our website. We may also use cookies to enhance performance, analyse site usage and to personalise your experience. Manage Preferences Accept All Essential Only",
    "salary": "",
    "postedDate": "",
    "source": "firecrawl",
    "fetchedAt": "2025-11-25T03:56:16.464Z",
    "status": "not_applied"
  },
  "resumeId": "96298940-768a-4d20-a6cb-33d793c474d4",
  "summary": "Atharva demonstrates strong technical fundamentals with proven experience building scalable full-stack applications using JavaScript, Python, and modern frameworks like Next.js and Node.js. While he meets most core requirements including large-scale product development and strong engineering practices, he lacks specific React/Redux expertise which is critical for this Pinterest role.",
  "tailoredBullets": [
    "Architected and delivered mission-critical Node.js/Express REST APIs supporting 100+ daily transactions with sub-200ms response times, demonstrating expertise in large-scale full-stack product development and performance optimization through PostgreSQL indexing strategies",
    "Built scalable Next.js/TypeScript applications with real-time API integrations, reducing JavaScript payload by 22% through code-splitting and performance tuning while supporting 100+ concurrent users with 150ms average latency",
    "Engineered full-stack MERN applications with JWT authentication and MongoDB persistence, implementing automated CI/CD pipelines that achieved 80-second commit-to-production cycles across 70+ deployments with comprehensive QA validation",
    "Collaborated with cross-functional teams to optimize web performance and accessibility, achieving 30% load performance improvements and 20% UX enhancement through systematic diagnostics and responsive design implementation",
    "Developed Python data pipelines processing 3,000+ monthly transactions, creating machine learning-ready datasets and reducing analysis time by 80% while maintaining robust software engineering principles and automated testing practices"
  ],
  "coverLetter": "Dear Pinterest Hiring Team,\n\nI am excited to apply for the Software Engineer II, Full Stack position at Pinterest. With my MS in Information Technology from Worcester Polytechnic Institute and proven experience building large-scale full-stack applications, I am well-positioned to contribute to Pinterest's mission of inspiring millions of users worldwide.\n\nIn my current role at Humanitarians AI, I have delivered mission-critical Node.js/Express APIs supporting high-volume transactions with sub-200ms response times, directly aligning with Pinterest's need for engineers who can support millions of users. My experience building scalable Next.js/TypeScript dashboards and MERN applications demonstrates my proficiency in JavaScript and Python, core requirements for this role. Additionally, my automated CI/CD implementations and performance optimization work showcase the strong software engineering principles Pinterest values.\n\nWhat particularly excites me about Pinterest is the opportunity to work on varied, high-impact projects that improve user experiences at scale. My background in optimizing web performance—achieving 30% load improvements and 22% JavaScript payload reductions—directly supports Pinterest's focus on solving site-wide challenges like performance and accessibility. My collaborative experience with cross-functional teams, from design to analytics, aligns perfectly with Pinterest's emphasis on working closely with product managers and designers.\n\nWhile I have extensive experience with modern web technologies and JavaScript frameworks, I am eager to deepen my expertise in React/Redux best practices, which I recognize as crucial for Pinterest's frontend architecture. My proven ability to quickly learn new technologies and drive initiatives from inception to release makes me confident I can contribute meaningfully to Pinterest's innovative culture while growing alongside world-class engineering peers.\n\nI look forward to discussing how my technical skills, collaborative mindset, and passion for building user-centric products can contribute to Pinterest's continued success.\n\nBest regards,\nAtharva Kamble",
  "missingSkills": [
    "Deep understanding of web development and best practices in React/Redux"
  ],
  "recommendedLearning": [
    "React/Redux framework and best practices",
    "Advanced React state management patterns",
    "Redux middleware and async actions",
    "React component lifecycle and hooks optimization"
  ],
  "fitScores": {
    "fit": 60,
    "skills": 86,
    "experience": 69,
    "overall": 72
  },
  "suitability": "moderate fit",
  "savedTo": "/Users/atharvakamble/Documents/CoreSpeed/backend/data/jobs/analysis_https___job-boards_greenhouse_io_pinterest_jobs_6142084.json"
}